WF/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСумма</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокМатериалов</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.СписокНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокУслуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.СписокНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WF/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.СписокНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

WF/src/Documents/ЗаказКлиента/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СписокМатериаловЦенаПриИзменении(Элемент)
	РасчетСтрокиМатериалы();
КонецПроцедуры

&НаКлиенте
Процедура СписокМатериаловКоличествоПриИзменении(Элемент)
	РасчетСтрокиМатериалы();
КонецПроцедуры


&НаКлиенте
Процедура РасчетСтрокиМатериалы()
	
	СтрокаРасчета = Элементы.СписокМатериалов.ТекущиеДанные;
	Если  СтрокаРасчета.ПроцентСкидки > 0 Тогда	
		СтрокаРасчета.Сумма = (СтрокаРасчета.Цена * СтрокаРасчета.Количество)-(СтрокаРасчета.Цена * СтрокаРасчета.Количество * СтрокаРасчета.ПроцентСкидки / 100)
	Иначе
		СтрокаРасчета.Сумма = СтрокаРасчета.Цена * СтрокаРасчета.Количество
	КонецЕсли
	
КонецПроцедуры 


&НаКлиенте
Процедура СписокМатериаловПроцентСкидкиПриИзменении(Элемент)
	РасчетСтрокиМатериалы();
КонецПроцедуры

&НаКлиенте
Процедура СписокМатериаловМатериалПриИзменении(Элемент)
	СтрокаРасчета = Элементы.СписокМатериалов.ТекущиеДанные;
	СтрокаРасчета.Цена= ПоулчитьАктуальнуюЦенуНоменклатуры(СтрокаРасчета.Материал, Объект.Дата);
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПоулчитьАктуальнуюЦенуНоменклатуры(Номенклатура, ПериодОтбора);
	Возврат РегистрыСведений.ЦеныНоменклатуры.ПолучитьАктуальнуюЦену(Номенклатура, ПериодОтбора);
КонецФункции // ПоулчитьАктуальнуюЦенуНоменклатуры()


&НаКлиенте
Процедура СписокУслугиУслугаПриИзменении(Элемент)
	СтрокаРасчета = Элементы.СписокУслуги.ТекущиеДанные;
	СтрокаРасчета.Сумма =  ПоулчитьАктуальнуюЦенуНоменклатуры(СтрокаРасчета.Услуга, Объект.Дата);
КонецПроцедуры
